from aiogram.types import Message
from aiogram.filters import Command, CommandStart
from aiogram import Router
from document_agent.kb.kb import keyboard
router = Router()

@router.message(CommandStart())
async def start(message: Message):
    start_text = (
        "👋 Вітаємо у **DocQ&A Bot**!\n\n"
        "Цей бот допоможе вам швидко працювати з документами: завантажуйте файли, "
        "ставте запитання, і бот знайде потрібну інформацію.\n\n"
        "📚 **Як працює бот:**\n"
        "1️⃣ Завантажте документ (PDF, DOCX або TXT).\n"
        "2️⃣ Напишіть запитання, пов'язане з документом.\n"
        "3️⃣ Отримайте відповідь за кілька секунд!\n\n"
        "📖 **Що бот може робити:**\n"
        "- Шукати інформацію у ваших файлах.\n"
        "- Робити короткий огляд документа.\n"
        "- Відповідати на складні питання на основі тексту документа.\n\n"
        "🔒 **Конфіденційність:** Ваші дані обробляються з максимальною обережністю і не зберігаються після обробки.\n\n"
        "📩 Просто спробуйте завантажити файл і поставити запитання, щоб розпочати!"
        "/start - Перезапустити бота і дізнатися про його можливості.\n"
        "/description - Дізнатися про функціонал і переваги бота.\n"
        "/read - Відправ документ і задавай питання\n"
        "/help - Отримати інструкції з використання.\n"
        "/reset - Скинути всі завантажені файли та почати спочатку.\n\n"
    )
    await message.answer(start_text, parse_mode='Markdown', reply_markup=keyboard)

@router.message(Command('description'))
async def bot_description(message: Message):
    description = (
        "👋 Вітаємо у **DocumentReader Bot**!\n\n"
        "Цей бот допоможе вам швидко працювати з документами: завантажуйте файли, "
        "ставте запитання, і бот знайде потрібну інформацію.\n\n"
        "📚 **Як працює бот:**\n"
        "1️⃣ Завантажте документ (PDF, DOCX або TXT).\n"
        "2️⃣ Напишіть запитання, пов'язане з документом.\n"
        "3️⃣ Отримайте відповідь за кілька секунд!\n\n"
        "📖 **Що бот може робити:**\n"
        "- Шукати інформацію у ваших файлах.\n"
        "- Робити короткий огляд документа.\n"
        "- Відповідати на складні питання на основі тексту документа.\n\n"
        "🔒 **Конфіденційність:** Ваші дані обробляються з максимальною обережністю і не зберігаються після обробки.\n\n"
        "⚙️ **Доступні команди:**\n"
        "/start - Перезапустити бота і дізнатися про його можливості.\n"
        "/description - Дізнатися про функціонал і переваги бота.\n"
        "/read - Відправ документ і задавай питання\n"
        "/help - Отримати інструкції з використання.\n"
        "/reset - Скинути всі завантажені файли та почати спочатку.\n\n"
        "📩 Просто спробуйте завантажити файл і поставити запитання, щоб розпочати!"
    )
    await message.answer(description, parse_mode="Markdown", reply_markup=keyboard)

@router.message(Command('help'))
async def bot_help(message: Message):
    help_text = (
        "💡 **Довідка по використанню бота**\n\n"
        "**Цей бот дозволяє завантажувати документи (PDF, DOCX або TXT) та отримувати відповіді на запитання, пов'язані з їхнім змістом.**\n\n"
        "🔹 **Доступні команди:**\n"
        "/start — Почати взаємодію з ботом.\n"
        "/read — Розпочати процес роботи з документом. Бот попросить вас надіслати файл.\n"
        "/help — Відкрити це меню з довідкою.\n"
        "`STOP` — Завершити сесію запитань і видалити завантажений файл.\n\n"
        "🔹 **Як працює бот?**\n"
        "1. Використовуйте команду `/read` для початку роботи.\n"
        "2. Надішліть документ, який хочете проаналізувати.\n"
        "3. Задавайте питання про зміст документа, і бот надасть відповіді.\n"
        "4. Введіть `STOP`, щоб завершити сесію, видалити завантажений файл і почати знову.\n\n"
        "🔹 **Підтримувані формати файлів:**\n"
        "- PDF\n"
        "- DOCX\n"
        "- TXT\n\n"
        "❗️ **Примітка:**\n"
        "- Переконайтесь, що ваш документ читається і не захищений паролем.\n"
        "- Якщо виникають помилки, зверніться за допомогою до адміністратора.\n\n"
        "Залишилися запитання? Починайте із команди `/read`! 😊"
    )
    await message.answer(help_text, reply_markup=keyboard)

